app/views/pitches/index.html.erb

  <%= link_to 'Vote', pitch_vote_path(pitch_id: pitch.id), method: :post %>
  Vote Count: <%= pitch.votes.count %>
---
SELECT COUNT(*) FROM "votes"  WHERE "votes"."pitch_id" = $1  [["pitch_id", 3]]