app/controllers/pitches_controller.rb

SELECT  "pitches".* FROM "pitches"  WHERE "pitches"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "votes"  WHERE "votes"."pitch_id" = $1  [["pitch_id", 2]]
---
  def show
    @pitch = Pitch.find(params[:id])
    @votes = @pitch.votes.count